До 24 лютого 2022 року одним з важливих напрямків роботи ДП «АМПУ» було запровадження в ДП «АМПУ» управлінських систем ризик-менеджменту, що відповідно до керівних документів було покладено на відділ прогнозування та управління ризиками Служби аналізу та управління ризиками (далі - Служба).
 Водночас, запровадження воєнного стану, активні бойові дії та припинення роботи частини морських портів України суттєво обмежили (практично зупинили) роботу за даним напрямком діяльності, що призвело до фактичного скорочення функціоналу САУР до трьох основних напрямків:
1)	Організація та контроль посиленої охорони та оборони об’єктів
ДП «АМПУ» в умовах воєнного стану;
2)	Забезпечення взаємодії, контроль та листування з правоохоронними органами;
3)	Аналіз, узагальнення та надання обґрунтованих пропозицій до органів державної влади щодо нейтралізації загроз з боку російської федерації на діяльність ДП «АМПУ».
