import pandas as pd
import re

text = ["Внутрішній контроль – це комплекс заходів, що застосовуються керівником для забезпечення дотримання"
        " законності та ефективності використання коштів, досягнення результатів відповідно до встановленої мети, "
        "завдань, планів і вимог щодо діяльності Підприємства. анування і проведення внутрішнього аудиту та надання "
        "звітів за його результатами."]

# Удаляем знаки препинания и приводим к нижнему регистру
words = [re.sub(r'[^\w\s]', '', word.lower()) for word in text[0].split()]

# Фильтрация: оставляем только слова, не содержащие букву "ф"
filtered_words = [word for word in words if 'о' not in word]

# Создание списка (длина слова, слово)
lengths = [(len(word), word) for word in filtered_words]

# Сортировка по убыванию длины слова
sorted_words = sorted(lengths, reverse=True)

print("Отсортированные слова по длине (убывание):")
for length, word in sorted_words:
    print(f"{word}: {length}")

